translations = {
    "welcome": {
        "en": "🎲 Welcome, player!\nYou've entered the exciting world of dice games! Here, you can test your luck and compete with others for valuable Telegram stars ✨.\nReady to make your first roll? The bot is always up for a game! Good luck! 🍀",
        "ru": "🎲 Приветствую, игрок!\nТы попал в мир увлекательных игр в кости! Здесь ты можешь испытать удачу, соревнуясь с другими участниками за ценные звезды ✨.\nГотов сделать первый бросок? Бот всегда готов сыграть! Удачи! 🍀",
        "uk": "🎲 Вітаю, гравцю!\nТи потрапив у світ захопливих ігор у кості! Тут ти можеш випробувати свою удачу, змагаючись з іншими учасниками за цінні зірки ✨.\nГотовий зробити перший кидок? Бот завжди готовий зіграти! Успіху! 🍀",
    },
    "donate": {
        "en": "💰 Donate ⬇️",
        "ru": "💰 Пополнить ⬇️",
        "uk": "💰 Поповнити ⬇️",
    },
    "donate_text":{
        "en": "💰Select the number of stars to replenish⬇️",
        "ru": "💰Выберите количество звезд для пополнения⬇️",
        "uk": "💰Виберіть кількість зірок для поповнення⬇️",
    },
    "withdraw": {
        "en": "\nWrite the number of stars for the output.",
        "ru": "\nНапишите количество звезд для вывода.",
        "uk": "\nНапишіть кількість зірок для виведення.",
    },
    "withdraw_btn": {
        "en": "💰 Withdraw ⬆️",
        "ru": "💰 Вывести ⬆️",
        "uk": "💰 Вивести ⬆️",
    },
    "withdraw_available": {
        "en": "Available for withdrawal: {available_stars} stars ⭐️\n",
        "ru": "Доступно для вывода: {available_stars} звёзд ⭐️\n",
        "uk": "Доступно для виведення: {available_stars} зірок ⭐️\n",
    },
    "withdraw_unavailable": {
        "en": "Not enough stars for withdrawal. Available: {available_stars} ⭐️, need a minimum of 1000 ⭐️.",
        "ru": "Недостаточно звёзд для вывода. Доступно: {available_stars} ⭐️, нужно минимум 1000 ⭐️.",
        "uk": "Недостатньо зірок для виведення. Доступно: {available_stars} ⭐️, потрібно мінімум 1000 ⭐️.",
    },
    "min_withdraw": {
        "en": "The minimum withdrawal amount is 1000 stars ⭐️.",
        "ru": "Минимальная сумма для вывода — 1000 звёзд ⭐️.",
        "uk": "Мінімальна сума для виведення — 1000 зірок ⭐️.",
    },
    "max_withdraw": {
        "en": "You can only withdraw up to {available_stars} stars ⭐️.",
        "ru": "Вы можете вывести не более {available_stars} звёзд ⭐️.",
        "uk": "Ви можете вивести не більше {available_stars} зірок ⭐️.",
    },
    "withdraw_success": {
        "en": "Withdrawal successfully completed for the amount of {amount} ⭐️.\nDetails:\n{details}",
        "ru": "Вывод успешно завершён на сумму {amount} ⭐️.\nДетали:\n{details}",
        "uk": "Виведення успішно завершено на суму {amount} ⭐️.\nДеталі:\n{details}",
    },
    "withdraw_detail": {
        "en": "Withdraw ID #{withdraw_id}, Transaction #{transaction_id}: -{amount} ⭐️",
        "ru": "ID вывода #{withdraw_id}, Транзакция #{transaction_id}: -{amount} ⭐️",
        "uk": "ID виведення #{withdraw_id}, Транзакція #{transaction_id}: -{amount} ⭐️",
    },
    "invalid_amount": {
        "en": "Please enter a valid amount.",
        "ru": "Пожалуйста, введите корректное число.",
        "uk": "Будь ласка, введіть коректне число.",
    },
    "balance": {
        "en": "💰 Your current balance: {balance} ⭐️",
        "ru": "💰 Ваш текущий баланс: {balance} ⭐️",
        "uk": "💰 Ваш поточний баланс: {balance} ⭐️",
    },
    "balance_btn": {
        "en": "💰 My balance ⭐️",
        "ru": "💰 Мой баланс ⭐️",
        "uk": "💰 Мій баланс ⭐️",
    },
    "cancel_btn":{
        "en": "❌ Cancel",
        "ru": "❌ Отмена",
        "uk": "❌ Скасувати",
    },
    "join_dice_btn":{
        "en": "Join the game 🎲 (Bet: {bet})",
        "ru": "Присоединиться к игре 🎲 (Ставка: {bet})",
        "uk": "Приєднатися до гри 🎲 (Ставка: {bet})",
    },
    "cancel_error_msg":{
        "en": "⚠️ Game not found or already completed.",
        "ru": "⚠️ Игра не найдена или уже завершена.",
        "uk": "⚠️ Гру не знайдено або вже завершено.",
    },
    "cancel_creator_error_msg":{
        "en": "⚠️ Only the creator of the game can cancel it.",
        "ru": "⚠️ Только создатель игры может её отменить.",
        "uk": "⚠️ Тільки творець гри може її скасувати.",
    },
    "cancel_success_msg":{
        "en": "The game has been successfully canceled.",
        "ru": "Игра успешно отменена.",
        "uk": "Гру успішно скасовано.",
    },
    "register_help_msg":{
        "en": "⚠️ Please specify the bid after the command. Example: /dice 100",
        "ru": "⚠️ Пожалуйста, укажите ставку после команды. Пример: /dice 100",
        "uk": "⚠️ Будь ласка, вкажіть ставку після команди. Приклад: /dice 100",
    },
    "register_no_stars_msg":{
        "en": "⚠️ Not enough stars to make the game.",
        "ru": "⚠️ Недостаточно звёзд для создания игры.",
        "uk": "⚠️ Не вистачає зірок, для створення гри.",
    },
    "wait_second_player_msg":{
        "en": "🎲 Game #{game_id} is created! Bet: {bet}. Waiting for the second player.",
        "ru": "🎲 Игра #{game_id} создана! Ставка: {bet}.\n\nОжидаем второго игрока.",
        "uk": "🎲 Гру #{game_id} створено! Ставка: {bet}.\n\nОчікуємо другого гравця.",
    },
    "game_not_found_msg":{
        "en": "⚠️ Game not found or already completed.",
        "ru": "⚠️ Игра не найдена или уже завершена.",
        "uk": "⚠️ Гру не знайдено або вже завершено.",
    },
    "error_connect_your_game_msg":{
        "en": "⚠️ You can't join your game.",
        "ru": "⚠️ Вы не можете присоединиться к своей игре.",
        "uk": "⚠️ Ви не можете приєднатися до своєї гри.",
    },
    "error_is_second_player_msg":{
        "en": "⚠️ This game already has a second player.",
        "ru": "⚠️ У этой игры уже есть второй игрок.",
        "uk": "⚠️ У цієї гри вже є другий гравець.",
    },
    "join_no_stars_msg":{
        "en": "⚠️ Not enough stars to join the game.",
        "ru": "⚠️ Недостаточно звёзд для присоединения к игре.",
        "uk": "⚠️ Не вистачає зірок, для приєднання гри.",
    },
    "game_start_msg":{
        "en": "🎲 Game #{game_id} is ready!\n\n Player 1: {player1_id}\n Player 2: {user_id}\n\nWait for the game to start.",
        "ru": "🎲 Игра #{game_id} готова!\n\nИгрок 1: {player1_id}\nИгрок 2: {user_id}\n\nОжидайте начала игры.",
        "uk": "🎲 Гра #{game_id} готова! \n\nГравець 1: {player1_id}\nГравець 2: {user_id}\n\nОчікуйте початку гри.",
    },
    "succes_join_msg":{
        "en": "You have successfully joined the game!",
        "ru": "Вы успешно присоединились к игре!",
        "uk": "Ви успішно приєдналися до гри!",
    },
    "error_already_in_game_msg": {
        "en": "⚠️ You are already participating in a game. Please finish it first.",
        "ru": "⚠️ Вы уже участвуете в игре. Пожалуйста, завершите её.",
        "uk": "⚠️ Ви вже берете участь у грі. Будь ласка, завершіть її."
    },
}
