translations = {
    "welcome": {
        "en": "👋 Welcome to our bot! Please choose an option below:",
        "ru": "👋 Добро пожаловать в наш бот! Пожалуйста, выберите действие ниже:",
        "uk": "👋 Ласкаво просимо до нашого бота! Будь ласка, виберіть дію нижче:",
    },
    "donate": {
        "en": "💰 Donate ⬇️",
        "ru": "💰 Пополнить ⬇️",
        "uk": "💰 Поповнити ⬇️",
    },
    "withdraw": {
        "en": "\nWrite the number of stars for the output.",
        "ru": "\nНапишите количество звезд для вывода.",
        "uk": "\nНапишіть кількість зірок для виведення.",
    },
    "withdraw_btn": {
        "en": "💰 Withdraw ⬆️",
        "ru": "💰 Вывести ⬆️",
        "uk": "💰 Вивести ⬆️",
    },
    "withdraw_available": {
        "en": "Available for withdrawal: {available_stars} stars ⭐️\n",
        "ru": "Доступно для вывода: {available_stars} звёзд ⭐️\n",
        "uk": "Доступно для виведення: {available_stars} зірок ⭐️\n",
    },
    "withdraw_unavailable": {
        "en": "Not enough stars for withdrawal. Available: {available_stars} ⭐️, need a minimum of 1000 ⭐️.",
        "ru": "Недостаточно звёзд для вывода. Доступно: {available_stars} ⭐️, нужно минимум 1000 ⭐️.",
        "uk": "Недостатньо зірок для виведення. Доступно: {available_stars} ⭐️, потрібно мінімум 1000 ⭐️.",
    },
    "min_withdraw": {
        "en": "The minimum withdrawal amount is 1000 stars ⭐️.",
        "ru": "Минимальная сумма для вывода — 1000 звёзд ⭐️.",
        "uk": "Мінімальна сума для виведення — 1000 зірок ⭐️.",
    },
    "max_withdraw": {
        "en": "You can only withdraw up to {available_stars} stars ⭐️.",
        "ru": "Вы можете вывести не более {available_stars} звёзд ⭐️.",
        "uk": "Ви можете вивести не більше {available_stars} зірок ⭐️.",
    },
    "withdraw_success": {
        "en": "Withdrawal successfully completed for the amount of {amount} ⭐️.\nDetails:\n{details}",
        "ru": "Вывод успешно завершён на сумму {amount} ⭐️.\nДетали:\n{details}",
        "uk": "Виведення успішно завершено на суму {amount} ⭐️.\nДеталі:\n{details}",
    },
    "withdraw_detail": {
        "en": "Withdraw ID #{withdraw_id}, Transaction #{transaction_id}: -{amount} ⭐️",
        "ru": "ID вывода #{withdraw_id}, Транзакция #{transaction_id}: -{amount} ⭐️",
        "uk": "ID виведення #{withdraw_id}, Транзакція #{transaction_id}: -{amount} ⭐️",
    },
    "invalid_amount": {
        "en": "Please enter a valid amount.",
        "ru": "Пожалуйста, введите корректное число.",
        "uk": "Будь ласка, введіть коректне число.",
    },
    "balance": {
        "en": "💰 Your current balance: {balance} ⭐️",
        "ru": "💰 Ваш текущий баланс: {balance} ⭐️",
        "uk": "💰 Ваш поточний баланс: {balance} ⭐️",
    },
    "balance_btn": {
        "en": "💰 My balance ⭐️",
        "ru": "💰 Мой баланс ⭐️",
        "uk": "💰 Мій баланс ⭐️",
    },
    "cancel_btn":{
        "en": "🚪 Cancel",
        "ru": "🚪 Отмена",
        "uk": "🚪 Скасувати",
    },
}
