translations = {
    "short_description": {
        "en": "Bot to play dice on Telegram stars with friends🎲\n\nOur group for games https://t.me/diceGamingGroup.",
        "ru": "Бот для игры в кости на Telegram звезды с друзьями🎲\n\nНаша группа для игр https://t.me/diceGamingGroup",
        "uk": "Бот для гри в кості на Telegram зірки з друзями🎲\n\nНаша група для ігор https://t.me/diceGamingGroup",
    },
    "description": {
        "en": "To play with friends in 🎲, add the bot to the group and write /start, it is desirable to appoint the bot as an administrator or give permission to delete messages to avoid errors. Have a good game🍀",
        "ru": "Чтобы сыграть с друзьями в 🎲, добавьте бота в группу и напишите /start, желательно назначить бота администратором либо дать разрешение на удаление сообщений, для избежания ошибок. Удачной игры🍀",
        "uk": "Щоб зіграти з друзями в 🎲, додайте бота в групу і напишіть /start, бажано призначити бота адміністратором або дати дозвіл на видалення повідомлень, для уникнення помилок. Вдалої гри🍀",
    },
    "start_command_desc": {
        "en": "Start the bot",
        "ru": "Запустить бота",
        "uk": "Запустити бота",
    },
    "start_command_desc_group": {
        "en": "Start the bot(write this before using the bot)",
        "ru": "Запустить бота(напишите это перед тем как пользоваться ботом)",
        "uk": "Запустити бота(напишіть це перед тим як користуватися ботом)",
    },
    "dice_command_desc": {
        "en": "Start a dice game",
        "ru": "Начать игру в кости",
        "uk": "Почати гру в кості",
    },
    "privacy_command_desc": {
        "en": "User Agreement",
        "ru": "Пользовательское соглашение",
        "uk": "Користувацька угода",
    },
    "changelang_command_desc": {
        "en": "Changing the language",
        "ru": "Смена языка",
        "uk": "Зміна мови",
    },
}