translations = {
    "join_dice_btn":{
        "en": "Join the game 🎲 (Bet: {bet})",
        "ru": "Присоединиться к игре 🎲 (Ставка: {bet})",
        "uk": "Приєднатися до гри 🎲 (Ставка: {bet})",
    },
    "cancel_error_msg":{
        "en": "⚠️ Game not found or already completed.",
        "ru": "⚠️ Игра не найдена или уже завершена.",
        "uk": "⚠️ Гру не знайдено або вже завершено.",
    },
    "cancel_creator_error_msg":{
        "en": "⚠️ Only the creator of the game can cancel it.",
        "ru": "⚠️ Только создатель игры может её отменить.",
        "uk": "⚠️ Тільки творець гри може її скасувати.",
    },
    "cancel_success_msg":{
        "en": "The game has been successfully canceled.",
        "ru": "Игра успешно отменена.",
        "uk": "Гру успішно скасовано.",
    },
    "register_help_msg":{
        "en": "⚠️ Please specify the bid after the command. Example: /dice 100",
        "ru": "⚠️ Пожалуйста, укажите ставку после команды. Пример: /dice 100",
        "uk": "⚠️ Будь ласка, вкажіть ставку після команди. Приклад: /dice 100",
    },
    "register_no_stars_msg":{
        "en": "⚠️ Not enough stars to make the game.",
        "ru": "⚠️ Недостаточно звёзд для создания игры.",
        "uk": "⚠️ Не вистачає зірок, для створення гри.",
    },
    "wait_second_player_msg":{
        "en": "🎲 Game #{game_id} is created! Bet: {bet}. Waiting for the second player.",
        "ru": "🎲 Игра #{game_id} создана! Ставка: {bet}.\n\nОжидаем второго игрока.",
        "uk": "🎲 Гру #{game_id} створено! Ставка: {bet}.\n\nОчікуємо другого гравця.",
    },
    "game_not_found_msg":{
        "en": "⚠️ Game not found or already completed.",
        "ru": "⚠️ Игра не найдена или уже завершена.",
        "uk": "⚠️ Гру не знайдено або вже завершено.",
    },
    "error_connect_your_game_msg":{
        "en": "⚠️ You can't join your game.",
        "ru": "⚠️ Вы не можете присоединиться к своей игре.",
        "uk": "⚠️ Ви не можете приєднатися до своєї гри.",
    },
    "error_is_second_player_msg":{
        "en": "⚠️ This game already has a second player.",
        "ru": "⚠️ У этой игры уже есть второй игрок.",
        "uk": "⚠️ У цієї гри вже є другий гравець.",
    },
    "join_no_stars_msg":{
        "en": "⚠️ Not enough stars to join the game.",
        "ru": "⚠️ Недостаточно звёзд для присоединения к игре.",
        "uk": "⚠️ Не вистачає зірок, для приєднання гри.",
    },
    "game_start_msg":{
        "en": "🎲 Game #{game_id} is ready!\n\n Player 1: @{player1_id}\n Player 2: @{user_id}\n\n@{player1_id} to start send an emoji 🎲",
        "ru": "🎲 Игра #{game_id} готова!\n\nИгрок 1: @{player1_id}\nИгрок 2: @{user_id}\n\n@{player1_id}, чтобы начать отправьте эмодзи 🎲",
        "uk": "🎲 Гра #{game_id} готова! \n\nГравець 1: @{player1_id}\nГравець 2: @{user_id}\n\n@{player1_id}, щоб почати відправте емодзі 🎲",
    },
    "game_start_online1_msg":{
        "en": "🎲 Game #{game_id} is ready!\n\n Player 1: @{player1_id}\n Player 2: @{user_id}\n\nTo start send an emoji 🎲",
        "ru": "🎲 Игра #{game_id} готова!\n\nИгрок 1: @{player1_id}\nИгрок 2: @{user_id}\n\nЧтобы начать отправьте эмодзи 🎲",
        "uk": "🎲 Гра #{game_id} готова! \n\nГравець 1: @{player1_id}\nГравець 2: @{user_id}\n\nЩоб почати відправте емодзі 🎲",
    },
    "game_start_online2_msg":{
        "en": "🎲 Game #{game_id} is ready!\n\n Player 1: @{player1_id}\n Player 2: @{user_id}\n\nWait for the first player to roll",
        "ru": "🎲 Игра #{game_id} готова!\n\nИгрок 1: @{player1_id}\nИгрок 2: @{user_id}\n\nОжидайте бросок первого игрока",
        "uk": "🎲 Гра #{game_id} готова! \n\nГравець 1: @{player1_id}\nГравець 2: @{user_id}\n\nЧекайте на кидок першого гравця",
    },
    "succes_join_msg":{
        "en": "You have successfully joined the game!",
        "ru": "Вы успешно присоединились к игре!",
        "uk": "Ви успішно приєдналися до гри!",
    },
    "error_already_in_game_msg": {
        "en": "⚠️ You are already participating in a game. Please finish it first.",
        "ru": "⚠️ Вы уже участвуете в игре. Пожалуйста, завершите её.",
        "uk": "⚠️ Ви вже берете участь у грі. Будь ласка, завершіть її."
    },
    "cancel_btn":{
        "en": "❌ Cancel",
        "ru": "❌ Отмена",
        "uk": "❌ Скасувати",
    },
    "user_no_game_msg":{
        "en": "To start the game, write the command /dice amount bet, for example /dice 100",
        "ru": "Чтобы начать игру, напишите команду /dice сумма ставки, к примеру /dice 100",
        "uk": "Щоб почати гру, напишіть команду /dice сума ставки, наприклад /dice 100",
    },
    "already_roll_dice":{
        "en": "⚠️ You've already rolled the dice. We are waiting for the second player to roll.",
        "ru": "⚠️ Вы уже бросили кубик. Ждём броска второго игрока.",
        "uk": "⚠️ Ви вже кинули кубик. Чекаємо на кидок другого гравця.",
    },
    "first_result":{
        "en": "🎲 You have thrown: {dice_value}. Wait for the second player to throw.\n\n @{user_name} your turn",
        "ru": "🎲 Вы выбросили: {dice_value}. Ожидаем броска второго игрока.\n\n @{user_name} ваш ход",
        "uk": "🎲 Ви викинули: {dice_value}. Очікуємо кидка другого гравця.\n\n @{user_name} ваш хід",
    },
    "first_result_online":{
        "en": "🎲 You have thrown: {dice_value}.\n\n Wait for the second player to throw",
        "ru": "🎲 Вы выбросили: {dice_value}.\n\n Ожидаем броска второго игрока",
        "uk": "🎲 Ви викинули: {dice_value}.\n\n Очікуємо кидка другого гравця",
    },
    "wait_first_player":{
        "en": "⚠️ The first player has not yet rolled a dice.",
        "ru": "⚠️ Первый игрок ещё не бросил кубик.",
        "uk": "⚠️ Перший гравець ще не кинув кубик.",
    },
    "wait_second_player":{
        "en": "⚠️ Waiting for the second player to join the game.",
        "ru": "⚠️ Ожидаем присоединения второго игрока.",
        "uk": "⚠️ Очікуємо приєднання другого гравця."
    },
    "already_roll_dice_second_player":{
        "en": "⚠️ You've already rolled the die. Wait for the result.",
        "ru": "⚠️ Вы уже бросили кубик. Ожидайте результата.",
        "uk": "⚠️ Ви вже кинули кубик. Очікуйте результату.",
    },
    "second_result":{
        "en": "🎲 You threw away: {dice_value}.",
        "ru": "🎲 Вы выбросили: {dice_value}.",
        "uk": "🎲 Ви викинули: {dice_value}.",
    },
    "game_is_not_end":{
        "en": "⚠️ Unable to determine a winner: game not completed.",
        "ru": "⚠️ Невозможно определить победителя: игра не завершена.",
        "uk": "⚠️ Неможливо визначити переможця: гру не завершено.",
    },
    "first_player_winner":{
        "en": "🎉 Winner: Player 1 @{winner_name} won {bet}⭐️",
        "ru": "🎉 Победитель: Игрок 1 @{winner_name} выиграл {bet}⭐️",
        "uk": "🎉 Переможець: Гравець 1 @{winner_name} виграв {bet}⭐️",
    },
    "second_player_winner":{
        "en": "🎉 Winner: Player 2 @{winner_name} won {bet}⭐️",
        "ru": "🎉 Победитель: Игрок 2 @{winner_name} выиграл {bet}⭐️",
        "uk": "🎉 Переможець: Гравець 2 @{winner_name} виграв {bet}⭐️",
    },
    "draw_msg":{
        "en": "🎲 Tie! Both players threw out the same numbers.",
        "ru": "🎲 Ничья! Оба игрока выбросили одинаковые числа.",
        "uk": "🎲 Нічия! Обидва гравці викинули однакові числа.",
    },
    "game_end":{
        "en": "Game over!",
        "ru": "Игра завершена!",
        "uk": "Гру завершено!",
    },
    "critical_error":{
        "en": "A critical error occurred, the results were not saved",
        "ru": "Произошла критическая ошибка, результаты не были сохранены",
        "uk": "Сталася критична помилка, результати не були збережені",
    },
    "time_out":{
        "en": "⏳ The game was canceled because no one rolled a dice in 10 minutes.",
        "ru": "⏳ Игра была отменена, так как никто не бросил кость за 10 минут.",
        "uk": "⏳ Гру було скасовано, оскільки ніхто не кинув кубик за 10 хвилин.",
    },
    "warning_for_second_player":{
        "en": "⚠️ @{second_player}, if you don't roll a dice within 5 minutes, you lose.",
        "ru": "⚠️ @{second_player}, если вы не бросите кость в течение 5 минут, вы проиграете.",
        "uk": "⚠️ @{second_player}, якщо ви не кинете кубик протягом 5 хвилин, ви програєте.",
    },
    "first_player_auto_win":{
        "en": "⏳ Time's up! @{second_player} did not roll a dice. @{first_player} won {bet}⭐️.",
        "ru": "⏳ Время истекло! @{second_player} не бросил кость. @{first_player} выиграл {bet}⭐️.",
        "uk": "⏳ Час минув! @{second_player} не кинув кубик. @{first_player} виграв {bet}⭐️.",
    },
    "first_player_rolled": {
        "en": "🎲 @{user_name} rolled a dice with a value of {dice_value}.\n\nIt's your turn!",
        "ru": "🎲 @{user_name} выбросил кость со значением {dice_value}.\n\nВаш ход!",
        "uk": "🎲 @{user_name} кинув кубик зі значенням {dice_value}.\n\nВаш хід!",
    },
}