translations = {
    "join_dice_btn":{
        "en": "Join the game 🎲 (Bet: {bet})",
        "ru": "Присоединиться к игре 🎲 (Ставка: {bet})",
        "uk": "Приєднатися до гри 🎲 (Ставка: {bet})",
    },
    "cancel_error_msg":{
        "en": "⚠️ Game not found or already completed.",
        "ru": "⚠️ Игра не найдена или уже завершена.",
        "uk": "⚠️ Гру не знайдено або вже завершено.",
    },
    "cancel_creator_error_msg":{
        "en": "⚠️ Only the creator of the game can cancel it.",
        "ru": "⚠️ Только создатель игры может её отменить.",
        "uk": "⚠️ Тільки творець гри може її скасувати.",
    },
    "cancel_success_msg":{
        "en": "The game has been successfully canceled.",
        "ru": "Игра успешно отменена.",
        "uk": "Гру успішно скасовано.",
    },
    "register_help_msg":{
        "en": "⚠️ Please specify the bid after the command. Example: /dice 100",
        "ru": "⚠️ Пожалуйста, укажите ставку после команды. Пример: /dice 100",
        "uk": "⚠️ Будь ласка, вкажіть ставку після команди. Приклад: /dice 100",
    },
    "register_no_stars_msg":{
        "en": "⚠️ Not enough stars to make the game.",
        "ru": "⚠️ Недостаточно звёзд для создания игры.",
        "uk": "⚠️ Не вистачає зірок, для створення гри.",
    },
    "wait_second_player_msg":{
        "en": "🎲 Game #{game_id} is created! Bet: {bet}. Waiting for the second player.",
        "ru": "🎲 Игра #{game_id} создана! Ставка: {bet}.\n\nОжидаем второго игрока.",
        "uk": "🎲 Гру #{game_id} створено! Ставка: {bet}.\n\nОчікуємо другого гравця.",
    },
    "game_not_found_msg":{
        "en": "⚠️ Game not found or already completed.",
        "ru": "⚠️ Игра не найдена или уже завершена.",
        "uk": "⚠️ Гру не знайдено або вже завершено.",
    },
    "error_connect_your_game_msg":{
        "en": "⚠️ You can't join your game.",
        "ru": "⚠️ Вы не можете присоединиться к своей игре.",
        "uk": "⚠️ Ви не можете приєднатися до своєї гри.",
    },
    "error_is_second_player_msg":{
        "en": "⚠️ This game already has a second player.",
        "ru": "⚠️ У этой игры уже есть второй игрок.",
        "uk": "⚠️ У цієї гри вже є другий гравець.",
    },
    "join_no_stars_msg":{
        "en": "⚠️ Not enough stars to join the game.",
        "ru": "⚠️ Недостаточно звёзд для присоединения к игре.",
        "uk": "⚠️ Не вистачає зірок, для приєднання гри.",
    },
    "game_start_msg":{
        "en": "🎲 Game #{game_id} is ready!\n\n Player 1: {player1_id}\n Player 2: {user_id}\n\nWait for the game to start.",
        "ru": "🎲 Игра #{game_id} готова!\n\nИгрок 1: {player1_id}\nИгрок 2: {user_id}\n\nОжидайте начала игры.",
        "uk": "🎲 Гра #{game_id} готова! \n\nГравець 1: {player1_id}\nГравець 2: {user_id}\n\nОчікуйте початку гри.",
    },
    "succes_join_msg":{
        "en": "You have successfully joined the game!",
        "ru": "Вы успешно присоединились к игре!",
        "uk": "Ви успішно приєдналися до гри!",
    },
    "error_already_in_game_msg": {
        "en": "⚠️ You are already participating in a game. Please finish it first.",
        "ru": "⚠️ Вы уже участвуете в игре. Пожалуйста, завершите её.",
        "uk": "⚠️ Ви вже берете участь у грі. Будь ласка, завершіть її."
    },
    "cancel_btn":{
        "en": "❌ Cancel",
        "ru": "❌ Отмена",
        "uk": "❌ Скасувати",
    },
}