translations = {
    "payment_title": {
        "en": "Deposit the stars",
        "ru": "Пополнение звёзд",
        "uk": "Поповнення зірок",
    },
    "payment_description": {
        "en": "Deposit to {amount} ⭐️",
        "ru": "Пополнение на {amount} ⭐️",
        "uk": "Поповнення на {amount} ⭐️",
    },
    "donate": {
        "en": "💰 Donate ⬇️",
        "ru": "💰 Пополнить ⬇️",
        "uk": "💰 Поповнити ⬇️",
    },
    "donate_text":{
        "en": "💰Select the number of stars to deposit⬇️\n\nСommission 2 stars if deposit up to 100 stars and 2% if deposit⬇ from 100 stars",
        "ru": "💰Выберите количество звезд для пополнения⬇️\n\nКомиссия 2 звезды, если пополнение до 100 звезд и 2% если пополнение от 100",
        "uk": "💰Виберіть кількість зірок для поповнення⬇️\n\nКомісія 2 зірки, якщо поповнення до 100 зірок і 2% якщо поповнення від 100",
    },
    "donate_success":{
        "en": "✅ Balance successfully credited to {final_amount} ⭐️!",
        "ru": "✅ Баланс успешно пополнен на {final_amount} ⭐️!",
        "uk": "✅ Баланс успішно поповнено на {final_amount} ⭐️!",
    },
    "withdraw": {
        "en": "\nWrite the number of stars for the output.",
        "ru": "\nНапишите количество звезд для вывода.",
        "uk": "\nНапишіть кількість зірок для виведення.",
    },
    "withdraw_btn": {
        "en": "💰 Withdraw ⬆️",
        "ru": "💰 Вывести ⬆️",
        "uk": "💰 Вивести ⬆️",
    },
    "withdraw_text":{
        "en": "💰Select the number of stars to withdraw",
        "ru": "💰Выберите количество звезд для вывода⬇️",
        "uk": "💰Виберіть кількість зірок для виведення⬇️",
    },
    "withdraw_available": {
        "en": "Available for withdrawal: {available_stars} stars ⭐️\n",
        "ru": "Доступно для вывода: {available_stars} звёзд ⭐️\n",
        "uk": "Доступно для виведення: {available_stars} зірок ⭐️\n",
    },
    "withdraw_unavailable": {
        "en": "You don't have enough stars in your account.",
        "ru": "На вашем счете недостаточно звезд.",
        "uk": "На вашому рахунку недостатньо зірок.",
    },
    "min_withdraw": {
        "en": "The minimum withdrawal amount is 1000 stars ⭐️.",
        "ru": "Минимальная сумма для вывода — 1000 звёзд ⭐️.",
        "uk": "Мінімальна сума для виведення — 1000 зірок ⭐️.",
    },
    "max_withdraw": {
        "en": "You can only withdraw up to {available_stars} stars ⭐️.",
        "ru": "Вы можете вывести не более {available_stars} звёзд ⭐️.",
        "uk": "Ви можете вивести не більше {available_stars} зірок ⭐️.",
    },
    "withdraw_success": {
        "en": "Withdrawal successfully completed for the amount of {amount} ⭐️.\nDetails:\n{details}",
        "ru": "Вывод успешно завершён на сумму {amount} ⭐️.\nДетали:\n{details}",
        "uk": "Виведення успішно завершено на суму {amount} ⭐️.\nДеталі:\n{details}",
    },
    "withdraw_detail": {
        "en": "Withdraw ID #{withdraw_id}, Transaction #{transaction_id}: -{amount} ⭐️",
        "ru": "ID вывода #{withdraw_id}, Транзакция #{transaction_id}: -{amount} ⭐️",
        "uk": "ID виведення #{withdraw_id}, Транзакція #{transaction_id}: -{amount} ⭐️",
    },
    "withdraw_private_chat_error": {
        "en": "⚠️ This command is only available in private messages.",
        "ru": "⚠️ Эта команда доступна только в личных сообщениях.",
        "uk": "⚠️ Ця команда доступна тільки в особистих повідомленнях.",
    },
    "withdraw_group_chat_error": {
        "en": "⚠️ This command is only available in groups.",
        "ru": "⚠️ Эта команда доступна только в группах.",
        "uk": "⚠️ Ця команда доступна тільки в групах.",
    },
    "withdraw_active_game_error": {
        "en": "⚠️ You cannot withdraw stars while you are in an active game.",
        "ru": "⚠️ Вы не можете выводить звёзды, пока участвуете в активной игре.",
        "uk": "⚠️ Ви не можете виводити зірки, поки берете участь в активній грі."
    },
    "withdraw_no_exact_gift_combination": {
        "en": "⚠️An error occurred while displaying stars. Please contact technical support.",
        "ru": "⚠️Произошла ошибка во время вывода звезд, обратитесь к технической поддержке.",
        "uk": "⚠️Сталася помилка під час виведення зірок, зверніться до технічної підтримки.",
    },
    "invalid_amount": {
        "en": "Please enter a valid amount. If you are not ready to withdraw now, click ❌Cancel.",
        "ru": "Пожалуйста, введите корректное число. Если вы не готовы сейчас вывести, нажмите ❌Отмена",
        "uk": "Будь ласка, введіть коректне число. Якщо ви не готові зараз вивести, натисніть ❌Скасувати",
    },
    "balance": {
        "en": "💰 Your current balance: {balance} ⭐️",
        "ru": "💰 Ваш текущий баланс: {balance} ⭐️",
        "uk": "💰 Ваш поточний баланс: {balance} ⭐️",
    },
    "balance_btn": {
        "en": "💰 My balance ⭐️",
        "ru": "💰 Мой баланс ⭐️",
        "uk": "💰 Мій баланс ⭐️",
    },
    "cancel_btn":{
        "en": "❌ Cancel",
        "ru": "❌ Отмена",
        "uk": "❌ Скасувати",
    },
    "history_btn": {
        "en": "📋History📋",
        "ru": "📋История📋",
        "uk": "📋Історія📋"
    },
    "no_transactions": {
        "en": "You have no transactions.",
        "ru": "У вас нет транзакций.",
        "uk": "У вас немає транзакцій."
    },
    "history_msg": {
        "en": "*Transaction History:*\n\n{history}",
        "ru": "*История транзакций:*\n\n{history}",
        "uk": "*Історія транзакцій:*\n\n{history}"
    },
    "prev_page_btn": {
        "en": "⬅️ Previous",
        "ru": "⬅️ Назад",
        "uk": "⬅️ Назад"
    },
    "next_page_btn": {
        "en": "➡️ Next",
        "ru": "➡️ Вперед",
        "uk": "➡️ Вперед"
    },
    "transaction_row": {
        "en": "💳 ID: {transaction_id}, Amount: {amount} ⭐️, Closed: {is_closed}, Time: {timestamp}",
        "ru": "💳 ID: {transaction_id}, Сумма: {amount} ⭐️, Закрыта: {is_closed}, Время: {timestamp}",
        "uk": "💳 ID: {transaction_id}, Сума: {amount} ⭐️, Закрита: {is_closed}, Час: {timestamp}"
    },
    "yes": {
        "en": "Yes",
        "ru": "Да",
        "uk": "Так"
    },
    "no": {
        "en": "No",
        "ru": "Нет",
        "uk": "Ні"
    },
    "success_commission_withdraw": {
        "en": "✅ Successfully added {amount} to the commission_withdraw table.",
        "ru": "✅ Успешно добавлено {amount} в таблицу commission_withdraw.",
        "uk": "✅ Успішно додано {amount} в таблицю commission_withdraw."
    },
    "variance_msg": {
        "en": (
            "📊 Final Variance:\n"
            "🔹 Total Commission: {commission_total} ⭐️\n"
            "🔹 Total Withdrawn: {commission_withdraw_total} ⭐️\n"
            "🔸 Result: {variance} ⭐️"
        ),
        "ru": (
            "📊 Итоговая разница:\n"
            "🔹 Всего комиссий: {commission_total} ⭐️\n"
            "🔹 Всего выведено: {commission_withdraw_total} ⭐️\n"
            "🔸 Итог: {variance} ⭐️"
        ),
        "uk": (
            "📊 Підсумкова різниця:\n"
            "🔹 Усього комісій: {commission_total} ⭐️\n"
            "🔹 Усього виведено: {commission_withdraw_total} ⭐️\n"
            "🔸 Результат: {variance} ⭐️"
        )
    }
}