translations = {
    "welcome": {
        "en": "🎲 Welcome, player!\nYou've entered the exciting world of dice games! Here, you can test your luck and compete with others for valuable Telegram stars ✨.\nReady to make your first roll? The bot is always up for a game! Good luck! 🍀",
        "ru": "🎲 Приветствую, игрок!\nТы попал в мир увлекательных игр в кости! Здесь ты можешь испытать удачу, соревнуясь с другими участниками за ценные звезды ✨.\nГотов сделать первый бросок? Бот всегда готов сыграть! Удачи! 🍀",
        "uk": "🎲 Вітаю, гравцю!\nТи потрапив у світ захопливих ігор у кості! Тут ти можеш випробувати свою удачу, змагаючись з іншими учасниками за цінні зірки ✨.\nГотовий зробити перший кидок? Бот завжди готовий зіграти! Успіху! 🍀",
    },
    "choose_lang": {
        "en": "🌐 Select a language:",
        "ru": "🌐 Выберите язык:",
        "uk": "🌐 Виберіть мову:",
    },
    "success_lang": {
        "en": "✅ Language successfully changed",
        "ru": "✅ Язык успешно изменён",
        "uk": "✅ Мова успішно змінена",
    },
    "msg_for_update_btns": {
        "en": "⚠️ To change the language of the buttons - write /start again",
        "ru": "⚠️ Чтобы изменить язык кнопок - напишите еще раз /start",
        "uk": "⚠️ Щоб змінити мову кнопок - напишіть ще раз /start",
    },
}